DeleteEntity Method
 Deletes the existing entity created by %schema% in the element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool DeleteEntity(
	Schema schema
)
Visual Basic
Public Function DeleteEntity ( _
	schema As Schema _
) As Boolean
Visual C++
public:
bool DeleteEntity(
	Schema^ schema
)
Parameters
schema
Type: Autodesk.Revit.DB.ExtensibleStorageSchema
 Schema used for creation of the entity
Return Value
 True if entity was deleted, false if entity didn't exist
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  Writing of Entities of this Schema is not allowed to the current add-in.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →